{
    "SummerInternship Program":
        "We, at Microsoft Innovation Lab, organise an annual summer internship for new recruits to work on cutting-edge research projects in varied domains such as Robotics, Machine Learning, Artificial Intelligence, Sensor Networking, Virtual Reality, Brain-Computer Interface and App Development. The results and prototype demonstrations of these projects are presented at Roadshow, an event attended by a large number of students across disciplines at PES University.",    
    "#Code":
        "#Code is the annual 24-hour hackathon organised by the Lab, with students proposing interesting ideas and presenting projects from several domains. The hackathon also provides a learning platform to participating teams, with mentors and members of academia assisting them. Esteemed personalities from different industrial backgrounds come to judge the show, evaluating projects from all possible angles. #Code 2019 would be the 8th edition of the annual hackathon. The winners bag cash prizes totalling up to Rs. one lakh.",
    "Roadshow":
        "Roadshow is an Innovation Expo organized by the Lab each year after the Summer Internship Program. Microsoft Lab summer interns present the projects that they have worked on during the internship. This serves as a great platform for students from PES University to interact with MIL members and gain knowledge about the cutting-edge technologies that we work on. Roadshow also serves as a platform where our interns receive constructive feedback and further insights on their projects from experienced professionals, professors and their peers.",
    "Incito":
        "Incito is the ideathon organized by Microsoft Lab last organised in the year 2017.It is a conglomerate of brilliant minds, all incubating innovative ideas. The shortlisted 10 best ideas battle it out in the final round to win cash prizes up to Rs. 10,000 in all. The participants test the design and feasibility of their ideas without the constraints of implementing the same, hence encouraging innovative thinking. The best ideas are also provided the platform and resources to implement their ideas and make these a reality.",
    "Training on Research Paper Writing":
        "The lab members not only innovate, but also like to give back to the community by sharing their knowledge and experiences. One such event we have organized in the past includes Training on Research Paper Writing.", 
    "Workshops":
        "Microsoft Innovation Lab has organized various workshops in the past. A few of these include training in image processing techniques like OpenCV, talks on how to apply to esteemed international universities for further studies, Android Studio workshops and Arduino workshops."
   
}


