{"Apathetic ML": {"Name": "Apathetic ML", "interns": "Aditi Ahuja, Raunak Sengupta, Sparsh Temani, Vishwas Rajashekar", "mentors": "Animesh N D", "year": 2019, "imageURL": "", "PPT": "", "short summary": "Architecture Independent System for Distributed Machine Learning", "Project description": "This project aims to parallelize the computations involved in machine learn- ing algorithms, thereby improving their efficiency. It also aims to make the framework architecture-independent by using Kubernetes for both implemen- tation across platforms such as Google Cloud Platform, Azure, AWS etc. or a cluster of machines connected locally. This work explores the effect of par- allelism on some algorithms such as Linear and Logistic Regression, K-Means Clustering, Random Forest and Artificial Neural Networks and discusses the effects of external factors such as network delays and the mode of communi- cation used."}, "CritiQuali": {"Name": "CritiQuali", "interns": "Abhigna L Shastry, Karan Kumar G, Sumukh Aithal K", "mentors": "Sumanth V Rao", "year": 2019, "imageURL": "", "PPT": "", "short summary": "Customer review analysis to return company's critical issues.", "Project description": "Built a Customer Feedback Model to analyze the customer review data of a company, and help identify critical issues based on their severity and impact on customers as well as management. Customer review data for a company is collected and classified into categories (buckets). Aspect-based sentiment/emotion analysis is performed to filter out the negative-sentiment issues; Non-granular reviews (reviews that don’t give specific/detailed issues) are removed using dependency parsing, and issues are ranked based on a\nseverity score that is generated, to finally return the top-ranked issues."}, "Multi-terrain 3D Mapping Drone": {"Name": "Multi-terrain 3D Mapping Drone", "interns": "Aravind S, Agnibha Bhattacharyya, Rajat Hegde, Shrenik R", "mentors": "Athindra Bandi, Karthik PB", "year": 2019, "imageURL": "", "PPT": "", "short summary": "To build an unmanned aerial vehicle that goes on multiple terrains and using recorded flight data to create and map terrains for real-world applications", "Project description": "The project deals with the creation of a multi-terrain, 3D-mapping unmanned\naerial vehicle.It is achieved by attaching a set of modified wheels to a carbon\nfiber drone frame with the help of laser-cut acrylic sheets. The drone supports\n3D reconstruction and mapping using a stereo-camera setup and OpenCV."}, "Mythodex": {"Name": "Mythodex", "interns": "Ashwin R Bharadwaj, Abdur Rahman Hatim, Devika S Nair, Shreeram Suresh Chandra", "mentors": "Ananya Ravikumar", "year": 2019, "imageURL": "", "PPT": "", "short summary": "Automated Identification of scenes from Indian mythology using neural networks and text processing.", "Project description": "The aim of the project is to automate the identification of scenes from Indian mythology in works of art. A trained neural network is used to extract image features and categorize them. Images passed through the model undergo multiple levels of filtering and result in a list of elements (characters,animals,landscapes etc) from the image that bear meaningful relationships. The outputs from this level are analysed and mapped to a scene from the epics using a graph-based model. The end result of the project is an accurate identification and description of the scene being depicted."}, "Pressure2Path": {"Name": "Pressure2Path", "interns": "Anirudh S, Pranav Bhatt, Hardik Gourisaria", "mentors": "Sameer Raju Dhole", "year": 2019, "imageURL": "", "PPT": "", "short summary": "Using a smartphone`s barometer to track the live location of the\ndevice, thereby removing the permanent dependency on GPS.", "Project description": "Advancements in technology has led to the development of countless applications that aid in areas such as navigation and positioning. Many functionalities, such as GPS, have been made accessible to the masses via mobile devices, and provide accurate results. However, the major drawback of such accuracy is the high amounts of power consumed by the phone. Given the\nlimited battery capacity of such devices, prolonged use of the aforementioned functionalities becomes difficult. Observing this issue, it is clear that there is a need to provide accurate positioning while improving power efficiency. This project aims to achieve accurate tracking of the device location while navigating along a predefined route, relying on the pressure data collected\nby the barometer sensor present in the smartphone. The algorithm is made accurate using cell tower data collected by the phone on said route."}, "Project X": {"Name": "Project X", "interns": "Saahil Jain, Kavya S, Vishwa Pravin", "mentors": "Saksham Goyal", "year": 2019, "imageURL": "", "PPT": "", "short summary": "Autonomous car simulation using Reinforcement Learning", "Project description": "The field of mobility is going through a revolution that is changing how we understand transportation. We live in the beginning of the Autonomous Driving era. The poten-\ntial benefits of autonomous vehicles are immense: elimination of accidents caused by human errors, a reduction in carbon dioxide emission, more efficient use of energy and infrastructure, among others. This kind of vehicle has become a concrete reality and\nmay pave the way for future systems where computers take over the art of driving.\nIn this paper, we present a 2-model approach for autonomous driving of car in a cityscape. The first model is used to drive the car in a no - traffic lane from an initial\nstart location to the destination. The second model modifies the speed and brake states of the car on detecting obstacles within a specified range. We have trained the models using Reinforcement Learning in a simulator environment provided by CARLA."}, "Prosthetic Actuation System": {"Name": "Prosthetic Actuation System", "interns": "Srikrishna BR, Prajwal Billawa", "mentors": "Prof. M. Venkatarangan", "year": 2019, "imageURL": "", "PPT": "", "short summary": "A system which aids a disabled person confined to a wheel chair, by location the object chosen and actuating accordingly.", "Project description": ""}, "Roadmap": {"Name": "Roadmap", "interns": "Akshay Vasudeva Rao, Prakruti Prakash Rao, Ruchika Shashidhara, Sourav T Raveendran", "mentors": "Siddarth Karki, Tejvi M", "year": 2019, "imageURL": "", "PPT": "", "short summary": "Web tool for graphical descriptions of learning flows.", "Project description": "Over the years, the ways and processes people have employed to consume information and learn have changed in innumerable ways. The biggest change perhaps, is the emergence of the internet as the clear victor as a global source of knowledge.\n\nFor the sake of argument, the internet may be thought of as a big, disorganised kitchen with many chefs and no particular distribution of dish workload among them. Say chef-A fashions a particularly scrumptious starter dish-X while being moderately skilled at making the main course\ndish-Y and sadly, makes a rather foul dessert dish-Z. His colleague, chef-B makes a Michelin worthy main course dish-Y but is so-so at the other two components of a meal. Enter chef-C. He makes the best Poire la Beaujolaise\n(call it dish-Z) but is simply incapable of making anything else. Now, if you wanted a 3-course meal, what are your chances of getting an optimal dish-A, dish-B and dish-C and in that particular order? Bleak indeed. This is pre-\ncisely the issue that Roadmap solves. Deconstructing the analogy, the chefs are websites and the dishes are resources. Akin to a meal, information must\nbe consumed in a particular order and from the right source(s). Roadmap identifies blocks of prerequisite information pertaining to the desired ob-\njective topic and presents a platter of ranked resources procured from apt sources. These tasks are accomplished by parsing through various resources\nand identifying parent-child relationships between entities by virtue of varied approaches such as semantic nets, N-space clustering, ANNs that analyse the\nstatistical occurrences of entities and even contextualised word embeddings.\n\nGoing back to the analogy one last time, Roadmap takes structured learning from ”too many chefs spoil the broth” to ”the more the merrier”."}, "Timetable Generation": {"Name": "Timetable Generation", "interns": "Akash Hamirwasia, Rishit Chaudhary, Tanishq Vyas", "mentors": "Aishwarya Venkatesh, Ananya Ravikumar", "year": 2019, "imageURL": "", "PPT": "", "short summary": "Development of a web application to aid the process of Timetable Generation", "Project description": "Timetable scheduling can be designed as a constraint satisfaction problem and can be solved using various approaches. An optimal solution for a timetable scheduling problem is difficult\nto find using any generic algorithm, due to the diverse nature of hard constraints and preferences also known as soft constraints, which may vary from institution to institution. Various approaches aimed at finding optimal solutions to such constraint satisfaction problems use constraint optimization, coupled with algorithms such as genetic, swarm particle optimization,\ntabu search etc. but these approaches are problem dependent and hence are infeasible in real-world situations.\nIn this project, a pure Linear Constrained Optimization approach consisting of integer programming using binary variables has been explored. The developed solver class was tested\nusing real-world data gathered from the various departments of a university. On further inspection, the constraints of every department were strikingly different from each other. The solver class to be successful must accommodate such diversities and still generate optimal results. It was successfully able to handle all the hard constraints and optimize for almost all the soft constraints. This solution can be applied to a wide variety of real-world scheduling problems with the capability of add-on features."}, "Unibot": {"Name": "Unibot", "interns": "Sonam Shenoy, Tejas Srinivasan, Taran Singhania", "mentors": "Ishaan Lagwankar, Tejvi M", "year": 2019, "imageURL": "", "PPT": "", "short summary": "A multipurpose chatbot generalised for end-user application", "Project description": "Chatbots are starting to have an increasing presence in our daily life. Almost every ”customer support” agent is a chatbot. However, most chatbots are usually tailored for a specific task and use retrieval based systems. To solve this shortcoming, we proposed a hybrid model that uses both generative and retrieval based systems to give meaningful responses. We have also introduced generalization, by means of which users can feed their datasets and the model which trains on the cloud, should be able to create a chatbot for their needs. Given new data, using the dataset extension feature, the chatbot can be personalised to meet the user’s expectations. Based on the context of the conversation and the sentiment of the user, the decision system of the model decides an appropriate time to respond to the user’s query appropriately."}, "WSN Modelling": {"Name": "WSN Modelling", "interns": "Anish Reddy Y, Akshobhya Jamadagni K R, Shreyas GS, Shriprajwal Krishnamurthy", "mentors": "Deepesh Sahoo, Sarang Pramode", "year": 2019, "imageURL": "", "PPT": "", "short summary": "Design and Comparison of Wireless Sensor Networks", "Project description": "This project aims to build an application which a user who has insufficient knowledge about the various aspects related to designing a Wireless Sensor Network can input some basic needs of their network such as area, cost and type of Wireless Sensor Network required and the User Interface will help the user in doing so by appropriately stating the aspects that need to be taken care of while setting up the user-defined Wireless Sensor Network. The application will specify various things such as the placement of the nodes, the type of nodes to be used, etc. Wireless Sensor Network node\nplacement models are proposed which concentrate on one specific parameter viz., lifetime, latency and reliability. The user can choose the type of model according to his needs and the simulation is done accordingly.\n\nThus, the project compares WSN Architectures to find the best architecture to setup a WSN based on the constraints provided whilst also simulating all those results infographically to aid the user in setting up a simple Wireless Sensor Network."}, "Ball Catcher": {"Name": "Ball Catcher", "interns": "Manik, Karthik PB, Pavan, Sai Krishna", "mentors": "Tarun, Manoj, Prasanna", "year": 2018, "imageURL": "", "PPT": "", "short summary": "To estimate the trajectory of the thrown ball and collect it using a robotic arm.", "Project description": ""}, "Catch me if you GAN": {"Name": "Catch me if you GAN", "interns": "Aishwarya K, Nishanth Shetty, Tarun K, Tejvi M", "mentors": "Sharvanga G", "year": 2018, "imageURL": "", "PPT": "", "short summary": "", "Project description": "Synthesizing realistic human faces from a given text description as input on a trained GENERATIVE ADVERSARIAL NETWORK model."}, "Explodroid 2.0": {"Name": "Explodroid 2.0", "interns": "Athindra Bandi, Mayank Agarwal, Nandakrishna", "mentors": "Prasanna Venkatesan KS, Tarun Bhargav Sriram", "year": 2018, "imageURL": "", "PPT": "", "short summary": "Labelled map Generating Bot", "Project description": "Building a robot that maps and simultaneously labels all the obstacles in a given region."}, "Forget me Not": {"Name": "Forget me Not", "interns": "Anagha Ananth, Aniket Kaulavkar, Deepika Karanji, Dhruv Vohra, Puneeth Karkera, Vishnu S Murali", "mentors": "Animesh N D, Avinash", "year": 2018, "imageURL": "", "PPT": "", "short summary": "", "Project description": "An Android app to help patients suffering from moderate forms of memory impairing diseases such as Alzheimer’s and dementia, and to help reduce the burden on their caretakers."}, "MakinWaves": {"Name": "MakinWaves", "interns": "Aushim Nagarkatti, Malaika Vijay, Shruti Mohanty", "mentors": "Amith Kashyap", "year": 2018, "imageURL": "", "PPT": "", "short summary": "Motor Imagery based Brain-Computer Interface", "Project description": "This project aims To develop a Brain-Computer Interface that uses changes in sensorimotor rhythms recorded from Electroencephalographic signals as\ncontrol signals for an external device. Evoked Potentials from Motor Imagery are recorded and used to classify kinesthetic actions based on the EEG signal generated."}, "Oculus": {"Name": "Oculus", "interns": "Siddarth Karki, Sumedh Basarkod, Vishal S", "mentors": "Amith Kashyap", "year": 2018, "imageURL": "", "PPT": "", "short summary": "Classification of Ocular Signals using Electrooculography to Control External Devices", "Project description": "To control the cursor on a computer screen with the movement of eyeballs using Electrooculogram (EOG) headset."}, "HUMAN VS AI – Reinforcement learning in Games.": {"Name": "HUMAN VS AI – Reinforcement learning in Games.", "interns": "Ishaan Lagwanker, Niharika Pentapati, Saksham Goyal", "mentors": "Sree Hari K", "year": 2018, "imageURL": "", "PPT": "", "short summary": "To create an artificially intelligent bot that can play games comparable to a human, improve continuously over several iterations in a virtual environment and finally integrate it to any general game environment through reinforcement learning of a particular genre", "Project description": ""}, "INDRA - Gait Generation for Humanoid": {"Name": "INDRA - Gait Generation for Humanoid", "interns": "Arya Rajiv Chaloli, Karthik K Bhat, Vishwas NS", "mentors": "R Hariharan, Adith Kumar", "year": 2018, "imageURL": "", "PPT": "", "short summary": "Generation of stable and adaptive gait for humanoid robots using Central Pattern Generators", "Project description": ""}, "VRchitect": {"Name": "VRchitect", "interns": "Aishwarya Venkatesh, Aditya Girisha, Karan Panjabi", "mentors": "", "year": 2018, "imageURL": "", "PPT": "", "short summary": "To convert a rudimentary floor plan into an interactive virtual environment", "Project description": ""}, "Energy Aware low latency routing in wireless sensor networks": {"Name": "Energy Aware low latency routing in wireless sensor networks", "interns": "Aakansha pant, Sarang Pramod, Deepesh Sahoo", "mentors": "Ananya Ravikumar", "year": 2018, "imageURL": "", "PPT": "", "short summary": "Energy Aware low latency routing in wireless sensor networks", "Project description": ""}, "Brainchild: A Kinect-VR joint venture": {"Name": "Brainchild: A Kinect-VR joint venture", "interns": "Karan Rao, Manasa Jadadeesh, Nikitha Rao, Rohan Mohaptra, Sreenivas M Kandhade", "mentors": "Vasisht Guru Prasad, Rahul Ragesh, Pratik Shiyal", "year": 2017, "imageURL": "", "PPT": "", "short summary": "Kinect VR - Physiotherapy and Gait Analysis; Gamify Tedious excersises in VR to hasten Rehab. Diagnose Motor skill disorder and monitor improvements.", "Project description": "Gait and posture are important parameters of human movement that are impaired in the case of movement disorders, such as cerebral palsy. In such disorders, aspects\nof motor movement like balance and co-ordination are adversely aected. Cerebral palsy, in particular, can be treated by physical, occupational and speech therapy. But there is no cure. Physiotherapy is often prescribed to aected patients, but the rate of follow through is usually very low as patients nd very little incentive to complete their routines. We present a two-fold solution to this problem. We have developed a suite of virtual reality games that aim to gamify the physiotherapy routines, thereby providing incentive for patients to regularly engage in their prescribed exercises. We have also used the data obtained from the player's motions during the game to analyse joint angles and aid in the diagnosis of cerebral palsy. Additionally, the data so obtained was used to track a player's progress in posture and gait through the course of the physiotherapy regimen. This progress chart can be made available to the doctor overseeing the patient, who can then use this information to alter the physiotherapy as per the individual's requirement."}, "Emotion Analysis using machine learning": {"Name": "Emotion Analysis using machine learning", "interns": "Deepali Prabhu, Manish Soni, Sree Hari K", "mentors": "Nishanth Hegde, Shashwath S Bharadwaj", "year": 2017, "imageURL": "", "PPT": "", "short summary": "Detection of emotion patterns based on social media platforms and chats.", "Project description": "Our application determines if a person is falling into depression based on his twitter feed and gives him suggestions based on what data he has entered previously."}, "Explodroid": {"Name": "Explodroid", "interns": "Prasanna Venaktesan K S, Manoj Surya K, Tarun Bhargav Sriram, Dweepa Prasad", "mentors": "Adith Kumar Urs", "year": 2017, "imageURL": "", "PPT": "", "short summary": "To create a robot from scratch, which can map any unknown environment and then navigate around it autonomously. \n", "Project description": "Creating a development platform from scratch, using Kinect to generate a laser-scan which generates a map to navigate autonomously\n\n"}, "Logophile’s Companion": {"Name": "Logophile’s Companion", "interns": "Sumanth V Rao, Suraj Aralihalli, Tanmaya Udupa", "mentors": "Nishanth Hegde, Shashwath S Bharadwaj", "year": 2017, "imageURL": "", "PPT": "", "short summary": "Tagging meanings to Non-Trivial words which occur\nin a video", "Project description": "The task of pausing a video everytime you hear a complex words and searching up its meaning is both arduous and time consuming. Wouldn't it be a lot easier to automate this process, but at the same time ensuring that you learn the word and its usage. Logophiles Companion is a Vocabulary Learning assistant which annotates non-trivial words with their corresponding definitions on a real time basis as it occurs in a video. Every tough word which comes up frequently assumes the user to have learned its meaning and usage and becomes trivial over time. The model makes use of an Artificial Neural Net to classify words based on its complexity and uses wordnet to get their meanings."}, "Mapping of Textual Description to Facial Image": {"Name": "Mapping of Textual Description to Facial Image", "interns": " Piyush Surana, Varun Ranganathan", "mentors": "Nishanth Hegde, Shashwath S Bharadwaj", "year": 2017, "imageURL": "", "PPT": "", "short summary": "Mapping of Textual Description to Facial Image", "Project description": "Our idea involves the creation of a software application which helps the user retrieve the face of a person from a database just by inputting a description of his facial features. Our implementation makes use of image processing principles in conjunction with a neural network to extract and classify features from a given database of facial images at its core while, the complete application will also make use of NLP concepts.\nThis application can be used as an assistant to sketch artists in the criminal investigation procedure, to reduce the time required to develop a sketch by searching for the suspect from a database of images of known criminals. It can also work like a shazam for celebrities and in other similar applications where an image is to be retrieved based on its textual/verbal description."}, "ModCube": {"Name": "ModCube", "interns": "Sahiti Vallamreddy, Akshath Kachinthaya", "mentors": "Adith Kumar Urs", "year": 2017, "imageURL": "", "PPT": "", "short summary": "A Self-reconfigurable modular robotic system using electromagnets for versatile application", "Project description": "To build a modular robot with the ability to flip and attach to other units with the help of electromagnets."}, "Prosthetic Arm using myoelectric control": {"Name": "Prosthetic Arm using myoelectric control", "interns": "Sumedh Baradwaj", "mentors": "Amith Kashyap", "year": 2017, "imageURL": "", "PPT": "", "short summary": "Design and implementation of a fully functional artificial arm that can act as a replacement for the human arm ,with physiological speeds of response and strength as that of a human arm.", "Project description": ""}, "Stabiisation of a Mobile Robot in an irregular domain": {"Name": "Stabiisation of a Mobile Robot in an irregular domain", "interns": "Sudarshan CV, Shreyas K Narayan, Tanya Sharma", "mentors": "Vidyasagar V Gaikwad", "year": 2017, "imageURL": "", "PPT": "", "short summary": "Built a robot which can stabilize itself in an uneven terrain ", "Project description": ""}, "Tap to Order": {"Name": "Tap to Order", "interns": "Lavanya R, Mridula Singhal, Prajwal Kiran Kumar, Shruti V Hegde", "mentors": "Manish Kumar, Shashwath S bharadwaj", "year": 2017, "imageURL": "", "PPT": "", "short summary": "A Smart Stock Monitoring System ", "Project description": "To build an intelligent ecosystem for inventory management. A prototype including the complete technology for monitoring stocks and providing user interfaces for both suppliers and customers was built."}, "WISE Net": {"Name": "WISE Net", "interns": "Aiswarya Sriram, Akshar Athreya, Amogha Sekhar, Rasya Ramesh, Vinayaka Kamath", "mentors": "Vasisht Guru Prasad, Sagar Belvadi, Shreyas Aradhya", "year": 2017, "imageURL": "", "PPT": "", "short summary": "A self aware Wireless Sensor Network", "Project description": "To create an intelligent and self aware wireless sensor network and implement an efficient routing algorithm onto it.\nTo use the network to monitor temperature conditions around college campus and send this data to the base station.\nAble to use this network in various IoT applications.\nVisualization of the network using data sent by the base station serially on Unity.\n"}, "Work In Progress": {"Name": "Work In Progress", "interns": "Sameer Dhole, Animesh N D, Meghana V S, Maanvi Nunna", "mentors": "Shashwath S Bharadwaj ", "year": 2017, "imageURL": "", "PPT": "", "short summary": "A Rerouting App to inform about road conditions", "Project description": "Bengaluru has been facing a crucial problem of potholes and road flooding during monsoon and its erratic weather pattern gives way to a lot of problems. There is no method which has been deployed to warn drivers about road health and rising water levels due to flooding.Vehicle failure is more prone to happen due to the above reason and thus eventually lead to heavy traffic. Thus our project aims at helping daily commuters by informing them via an app about damaged and waterlogged roads they may face enroute."}}
